{"status":"success","totalResults":12,"results":[{"title":"Changelly Pro Exchange répertorie la crypto-monnaie CSOV (Crown Sovereign) à résistance quantique","link":"https://www.prnewswire.com:443/news-releases/changelly-pro-exchange-repertorie-la-crypto-monnaie-csov-crown-sovereign-a-resistance-quantique-801973794.html","keywords":["Computer & Electronics","Banking & Financial Services","FIN","CPR"],"creator":null,"video_url":null,"description":"NEWPORT BEACH, Californie, 15 mars 2022 /PRNewswire/ -- Crown Sterling Limited LLC, un fournisseur de solutions de chiffrement et d'actifs numériques, annonce que son jeton utilitaire Crown Sovereign (CSOV) sera inscrit sur la plateforme Changelly Pro Exchange le 14 mars 2022. Changelly...","content":null,"pubDate":"2022-03-15 18:28:00","full_description":"NEWPORT BEACH , Californie , 15 mars 2022 /PRNewswire/ -- Crown Sterling Limited LLC, un fournisseur de solutions de chiffrement et d'actifs numériques, annonce que son jeton utilitaire Crown Sovereign (CSOV) sera inscrit sur la plateforme Changelly Pro Exchange le 14 mars 2022. Changelly Pro est un service d'échange de crypto-monnaie instantané non dépositaire, qui permet aux utilisateurs d'acheter et de vendre des crypto-monnaies. Soutenu par un protocole de sécurité blockchain à résistance quantique, le CSOV permet aux détenteurs de jetons d'utiliser et de participer à la révolution de la souveraineté des données personnelles avec la nouvelle technologie de Crown Sterling tout au long de 2022 et 2023. « Nous sommes enthousiasmés par l'utilité croissante de nos jetons : qu'il s'agisse du chiffrement et de la messagerie à résistance quantique, des collections de jetons non fongibles (NFT) ou de la compression mathématique/du stockage décentralisé. Avec le CSOV, les consommateurs seront en mesure de collecter les NFT de leurs propres actifs numériques, y compris les données », a déclaré Robert Grant , PDG et fondateur de Crown Sterling. Étant donné que les données deviennent le bien le plus précieux de l'ère numérique, le CSOV est un outil qui permettra aux individus de protéger, de contrôler et de monétiser leurs données à une époque où la vulnérabilité et la monopolisation des grandes entreprises technologiques ne sont pratiquement pas réglementées. Pour en savoir plus sur le CSOV et les autres offres technologiques de Crown Sterling, rejoignez la communauté sur Telegram et suivez-nous sur Twitter . À propos de Crown Sterling Limited LLC Crown Sterling est un pionnier des technologies de souveraineté des données personnelles et le premier à mettre en œuvre le système de chiffrement par masque jetable à résistance quantique comme option pour la fonction de transition d'état d'une blockchain, qui est le flux de traitement des transactions sur un réseau. Le Crown Sovereign (CSOV), un jeton utilitaire à résistance quantique, permet aux utilisateurs de participer à la vaste gamme de produits offerts, y compris la cryptographie et les NFT à résistance quantique, ainsi qu'à d'autres technologies de compression futures. Crown Sterling ambitionne de devenir la principale plateforme de gestion des données et des actifs numériques. Pour en savoir plus, rendez-vous sur le site https://www.crownsterling.io/ . Contact de Crown Sterling Limited LLC pour les médias Tél. : +1-949-260-1700 https://www.crownsterling.io/ Logo - https://mma.prnewswire.com/media/1749171/Crown_Sterling_Logo.jpg SOURCE Crown Sterling","image_url":"https://mma.prnewswire.com/media/1749171/Crown_Sterling_Logo.jpg?p=publish","source_id":"cision","country":["singapore"],"category":["top"],"language":"english"},{"title":"Maluma Announced as Official Formula 1® Crypto.com Miami Grand Prix Kick-Off Concert at Hard Rock Live in Hollywood, Fla., Thursday, May 5 at 8 p.m.","link":"https://www.prnewswire.com:443/news-releases/maluma-announced-as-official-formula-1-cryptocom-miami-grand-prix-kick-off-concert-at-hard-rock-live-in-hollywood-fla-thursday-may-5-at-8-pm-301503022.html","keywords":["Travel","Entertainment","Music","General Sports","Sporting Events","Hotels and Resorts","MUS","ENT","SSE","SPT","HRT","TRA"],"creator":null,"video_url":null,"description":"Tickets On Sale Friday, March 18 at 10 a.m. Editor's Note: High-res images can be downloaded here. HOLLYWOOD, Fla., March 15, 2022 /PRNewswire/ -- Global superstar, artist, actor and philanthropist Maluma is kicking off Formula 1® Crypto.com Miami Grand Prix race weekend with an intimate...","content":null,"pubDate":"2022-03-15 14:09:00","full_description":"Tickets On Sale Friday, March 18 at 10 a.m. Editor's Note: High-res images can be downloaded here . HOLLYWOOD, Fla. , March 15, 2022 /PRNewswire/ -- Global superstar, artist, actor and philanthropist Maluma is kicking off Formula 1® Crypto.com Miami Grand Prix race weekend with an intimate concert at Hard Rock Live at Seminole Hard Rock Hotel & Casino in Hollywood, Fla. on Thursday, May 5 at 8 p.m. Photo credit: Phraa Photo Credit: TES As a founding partner of Formula 1® Crypto.com Miami Grand Prix, Hard Rock International is bringing globally recognized superstars to celebrate the inaugural race in Miami at both the Miami International Autodrome and at Seminole Hard Rock Hotel & Casino Hollywood, the brand's flagship resort and home of the iconic Guitar Hotel. Maluma is the first of several A-list entertainers announced who are scheduled to perform during race weekend. Tickets go on sale Friday, March 18 at 10 a.m. ET and start at $105 . Tickets are available at www.myhrl.com . Fans can access venue presale on Wednesday, March 16 at 10 a.m. ET via Seminole Hard Rock Hollywood's Facebook and Twitter pages. Doors open one hour prior to show time. In addition to the concert experience at Hard Rock Live, Maluma is slated to make an appearance at Hard Rock Beach Club at the Miami International Autodrome during race weekend. Spanning the area by turns 11, 12 and 13, Hard Rock Beach Club is a highlight of the track that will give guests a uniquely South Florida environment to enjoy all of the race action with a 24,000 square-foot beach, resort-style pools and two levels of luxury cabanas. Juan Luis Londoño Arias, best known as Maluma, from Medellin, Colombia , has become a global Latin music idol. At only 28 years old, the Colombian superstar has a repertoire of smash hits and music collaborations with artists such as Madonna, Shakira, The Weeknd, Timbaland, Jason Derulo and Ricky Martin , among many others. He has recorded five albums: \"Pretty Boy Dirty Boy\" (2015), \"F.A.M.E.\" (2018 Latin Grammy winner for Best Contemporary Pop Vocal Album), \"11:11\" (2019), \" Papi Juancho \" (2020) which includes the worldwide hit \"Hawái,\" and \"7 Días en Jamaica \" (#7DJ). Maluma is a media leader due to his high impact on social media with more than 93 million active followers. He is the youngest artist with a total of 21 No.1 hits on Billboard's Latin Airplay chart, and if that weren't enough, he has conquered Latin America , the United States , Europe , Asia and the Middle East with his live concerts, breaking records with sold out shows in stadiums and arenas throughout the world. His passion for haute couture has led him to be an ambassador for luxury brands such as Versace and to co-design a special line with Balmain. In addition Maluma's altruistic spirit is outstanding for the community work he leads with his foundation \"El Arte de Los Sueños\" based in his native country. Founded in 2016, the Foundation's mission is to transform at-risk youth through art and music education bringing an inspiring message to young people. In November 2021 , Maluma starred in his first Disney animation movie, \"Encanto,\" which is nominated for a 2022 Oscar this year and was nominated by the Golden Globes. This 2022 the global superstar is back with his \"Papi Juancho Maluma World Tour 2022\" and debuted in Hollywood with his starring role as Bastian in the movie \"Marry Me\" alongside Jennifer Lopez and Owen Wilson . He also collaborated with Jennifer Lopez on the film's soundtrack. For more information visit: https://maluma.online/ and follow him on all social media platforms as @maluma. About Hard Rock®: Hard Rock International (HRI) is one of the most globally recognized companies with venues in 68 countries spanning 253 locations that include owned/licensed or managed Hotels, Casinos, Rock Shops®, Live Performance Venues and Cafes. HRI also launched a joint venture named Hard Rock Digital in 2020, an online sportsbook, retail sportsbook and internet gaming platform. Beginning with an Eric Clapton guitar, Hard Rock owns the world's largest and most valuable collection of authentic music memorabilia at more than 86,000 pieces, which are displayed at its locations around the globe. In 2021, Hard Rock was honored as one of Forbes Magazine's Best Employers for Diversity, a Top Employer for Women and the Top Employer in the Travel & Leisure, Gaming, and Entertainment Industry. Hard Rock was also designated as a U.S. Best Managed Company by Deloitte Private and The Wall Street Journal and named the top performing hotel brand in J.D. Power's North America Hotel Guest Satisfaction Study for the third consecutive year in 2021. The brand is owned by HRI parent entity The Seminole Tribe of Florida . For more information on Hard Rock International, visit www.hardrock.com or shop.hardrock.com. About Hard Rock Live Hard Rock Live at Seminole Hard Rock Hotel & Casino Hollywood is South Florida's premier entertainment venue. An investment of more than $125 million , the 7,000-person capacity indoor venue features clamshell-style seating, offering guests an intimate experience. Hard Rock Live ranked No. 3 worldwide in 2021 ticket sales for theatre venues by Pollstar Magazine. Designed by Scéno Plus, the 225,000 square-foot facility is equipped with state-of-the-art, in-house sound and lighting, large HD viewing screens and mobile-stage technology. With its advanced capabilities, Hard Rock Live can support some of the entertainment industries biggest performers, as well as nationally and internationally televised awards shows, sporting events and more. A-list entertainers to perform at Hard Rock Live include The Rolling Stones, Metallica , Guns N ' Roses, Maroon 5, Billy Joel , Dave Chappelle , among others. About Seminole Hard Rock Hotel & Casino Hollywood Seminole Hard Rock Hotel & Casino Hollywood is the flagship integrated resort of Hard Rock International, owned by the Seminole Tribe of Florida . The renowned entertainment, gaming and hospitality destination unveiled a $1.5 billion expansion in 2019, highlighting the debut of the world's first and only Guitar Hotel. Between three hotel towers, the resort boasts 1,271 luxury guestrooms . Amenities include a 42,000 square-foot Rock Spa® & Salon; a 18-acre recreational water experience; private \" Bora Bora \" style cabanas; more than 20 food and beverage outlets; an expansive gaming floor with 3,000 slots, 193 table games and a 45-table poker room; 120,000 square feet of premier meeting and convention space; and a 26,000 square-foot retail promenade. Hard Rock Live, ranked No. 3 worldwide in 2021 ticket sales for theatre venues by Pollstar Magazine, showcases A-list entertainers and performers, sporting events and live broadcast productions in an intimate 7,000-person capacity setting. Seminole Hard Rock Hollywood is located on 87 acres of the Hollywood Seminole Reservation along State Road 7 (U.S. Highway 441). For more information, visit us online at www.seminolehardrockhollywood.com , call 800-937-0010 or follow us: Facebook: SeminoleHardRockHollywood , Twitter: @ HardRockHolly , Instagram : @ HardRockHolly . SOURCE Hard Rock International","image_url":"https://mma.prnewswire.com/media/1766823/Hard_Rock_Live_Maluma.jpg?p=original","source_id":"cision","country":["singapore"],"category":["top"],"language":"english"},{"title":"CRYPTO TAX SURVEY: MAJORITY OF INVESTORS ARE PAYING TAXES ON CRYPTO, CONTRARY TO CRITICS CLAIMING OTHERWISE","link":"https://www.prnewswire.com:443/news-releases/crypto-tax-survey-majority-of-investors-are-paying-taxes-on-crypto-contrary-to-critics-claiming-otherwise-301502930.html","keywords":["Blockchain","Computer & Electronics","Cryptocurrency","ICO","BLN","CPR"],"creator":null,"video_url":null,"description":"Non-Tax Paying Survey Respondents Cite 'Confusion'—Not Intentional Tax Evasion—as Main Reason AUSTIN, Texas, March 15, 2022 /PRNewswire/ -- With Tax Day 2022 a little more than a month away, CoinLedger (rebranding from CryptoTrader.Tax), a leading tax-reporting platform geared toward...","content":null,"pubDate":"2022-03-15 13:34:00","full_description":"Non-Tax Paying Survey Respondents Cite 'Confusion'—Not Intentional Tax Evasion—as Main Reason AUSTIN, Texas , March 15, 2022 /PRNewswire/ -- With Tax Day 2022 a little more than a month away, CoinLedger (rebranding from CryptoTrader.Tax), a leading tax-reporting platform geared toward assisting cryptocurrency, DeFi, NFT, and Web3 users with simple tax reporting solutions, today released its 2022 \"State of Crypto Tax Reporting\" survey, conducted in partnership with YouGov. Seeking to understand better the current issues involving cryptocurrency taxes in the U.S., the survey asked investors, among other things, whether they currently report and pay taxes on crypto and, if not, what the most common reasons for not doing so are. When it Comes to Reporting and Paying Crypto Taxes – It's Complicated. According to CoinLedger's 2022 'State of Crypto Tax Reporting' Survey , American crypto investors seem to be as confused as ever when it comes to reporting taxes. More than 1,000 U.S. investors over the age of 18, who own or invest in cryptocurrency, sent the clear message that they want to pay taxes, but either 'didn't know that crypto was taxable' (25 percent) or 'didn't know how to report crypto on their tax returns' (20 percent). And, contrary to popular belief that crypto investors are looking to avoid paying taxes, a majority (50 percent) reported paying taxes on crypto. In comparison, only a small group of respondents (15 percent) claimed to intentionally avoid paying taxes, stating reasons such as 'the government doesn't know about my cryptocurrency' or 'I do not want to pay taxes.' Survey respondents also cited 'not having the software tools to properly account for their crypto transactions (20 percent) as the reason for not reporting crypto on their taxes, while almost 30 percent reported simply 'having trouble keeping track of their capital gains and losses.' Age is also likely a factor while not explicitly addressed in the CoinLedger survey. As reported in previous studies , cryptocurrency is most popular with a younger demographic, making them relatively new to investing and likely not as savvy regarding tax reporting obligations. \"Multiple factors continue to greatly impact investors' ability to track and report taxes on their digital assets accurately,\" said David Kemmerer , CEO, and Co-Founder of CoinLedger. \"While 'confusion' is not a valid reason for avoiding paying your taxes, it has become a reality for digital asset investors. New tax laws going into effect coupled with a growing number of U.S. states and international charities looking to or already accepting digital asset payments only makes the need for simple, user-friendly crypto tax and accounting software, specifically for DeFi users, more critical.\" Americans Lack Confidence in Policy Makers' Understanding of Industry. While it's nothing new for Americans to lack confidence in their elected officials, the CoinLedger/YouGov survey revealed that more than two-thirds (70 percent) of crypto investors do not believe the politicians and regulators drafting cryptocurrency laws understand the industry as a whole. \"There continues to be an urgent need for regulators to enact fair and effective crypto tax policy, not only in the U.S. but globally,\" added Kemmerer. \"Our survey revealed the number of crypto investors who are reporting it on their taxes has increased since 2018. Still, the industry has a long way to go from a regulatory perspective, especially when it comes to narrowing the gap between law-abiding crypto investors and those who are avoiding them due to lack of understanding, overall confusion or otherwise.\" Methodology To better understand the current issues involving cryptocurrency taxes in the U.S., CoinLedger partnered with YouGov to survey more than 1,000 U.S.-based adults (18+) who invest in cryptocurrency. The survey was conducted from November 22 – December 4, 2021 . For more information and to see the full results, go here https://cryptotrader.tax/annual-crypto-tax-report . About CoinLedger CoinLedger (rebranding from CryptoTrader.Tax) enables seamless portfolio tracking and tax reporting for participants of the digital asset economy. Founded in 2018, CoinLedger was built to reduce the friction of participating in the cryptocurrency ecosystem by making tax reporting as simple as possible. By directly integrating with major exchanges, wallets, blockchains, and NFT platforms, CoinLedger provides a unified dashboard for users to track and monitor their cryptocurrency activity. Whether you're trading cryptocurrencies, buying and selling NFTs, or staking on DeFi protocols, CoinLedger makes tracking your portfolio and reporting your taxes more straightforward than ever. For more information, visit https://cryptotrader.tax/world-meet-coinledger . SOURCE CoinLedger","image_url":"https://mma.prnewswire.com/media/1739031/CoinLedger_Logo.jpg?p=original","source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"CoinDesk Announces Alan Campbell as President, Data &amp; Indices","link":"https://www.prnewswire.com:443/news-releases/coindesk-announces-alan-campbell-as-president-data--indices-301502394.html","keywords":["Blockchain","Computer & Electronics","Banking & Financial Services","Cryptocurrency","FIN","CPR","BLN","ICO"],"creator":null,"video_url":null,"description":"NEW YORK, March 15, 2022 /PRNewswire/ -- Today, CoinDesk Inc. announces Alan Campbell as President, Data and Indices, where he will extend CoinDesk to become the leading solution for crypto data, benchmark pricing, and indices. CoinDesk Indices are the industry standard benchmarks for...","content":null,"pubDate":"2022-03-15 13:30:00","full_description":"NEW YORK , March 15, 2022 /PRNewswire/ -- Today, CoinDesk Inc . announces Alan Campbell as President, Data and Indices, where he will extend CoinDesk to become the leading solution for crypto data, benchmark pricing, and indices. CoinDesk Indices are the industry standard benchmarks for crypto assets. The flagship CoinDesk Bitcoin Price Index (XBX) has been in operation since 2014. Financial institutions rely on the XBX and other CoinDesk index products to benchmark tens of billions of dollars in assets under management and price hundreds of millions in over-the-counter transactions daily. Previously, Alan was Head of Product Management at Bloomberg Indices, where he was instrumental in launching Bloomberg's index business and most recently responsible for product management globally for equity, commodity, crypto, foreign exchange, and multi-asset benchmarks. During his 20+ year career at Bloomberg, Alan launched the business that became the fastest growing financial index business. He was pivotal in building a global multi-asset benchmark solution that changed the dynamic of the financial index industry through a combination of organic build, partnerships, and strategic acquisitions. Alan Campbell, Head of Product Management at Bloomberg Indices joins CoinDesk as President, Data and Indices. Tweet this Kevin Worth , CoinDesk CEO, said, \"I am thrilled to welcome Alan to the CoinDesk executive team. His leadership and experience, as well as a passion for contributing to the evolution of crypto as a mainstream asset class, will propel CoinDesk Indices and CoinDesk Media forward even faster towards our ambitious goals.\" Before Alan's most recent role, he also managed Bloomberg Terminal functions and special projects for the CEO of Bloomberg. In addition, he served in London as a Data Manager for EMEA, where he led multiple teams responsible for products such as Funds, Economy, Derivatives, and Third-Party Index. Alan Campbell , President of Data and Indices, said, \"This is a wonderful opportunity to work with the crypto media, events, and index team at CoinDesk. They are experts in their field and dedicated to the crypto economy. By tapping into the scale, support, and experience of Digital Currency Group, we'll be building cutting-edge crypto solutions to service an increasingly engaged institutional market. CoinDesk's goal to become the company to work for in crypto will be demonstrated as we substantially expand the team with diverse talent. Our goal is to build a leading data and benchmark solution which inspires, and is valued, by the market.\" Alan holds a B.A. in European Business with Languages from Glasgow Caledonian University. About CoinDesk, Inc: CoinDesk , a media, events, data, and indices company, is the most influential, trusted platform for the global crypto ecosystem. Founded in 2013, the CoinDesk Media platform provides millions of consumers interested in cryptocurrency assets and blockchain technology with news and insights , podcasts , live streaming TV shows , and research reports . CoinDesk Indices are the industry standard for institutional single and multi-asset benchmarks for crypto assets. The flagship CoinDesk Bitcoin Price Index (XBX) has been in operation continuously since 2014. Consensus is the iconic crypto and blockchain festival of the year. Since 2015, Consensus has gathered all sides of the crypto industry as it has grown from a clique of visionary founders to encompass every aspect of mainstream society. Curated & produced by CoinDesk , Consensus is the only event showcasing and celebrating all sides of the blockchain industry - NFTs, Web3, DeFi, Regulation, Investing, and the Metaverse - and their wide-reaching effect on commerce, culture, and communities. Consensus invites developers, creators, policymakers, executives, and academics from a wide array of projects to come together for the most influential event of the year. CoinDesk is a wholly-owned subsidiary of Digital Currency Group, one of the largest privately-held investment companies in the crypto industry whose mission is to accelerate the development of a better financial system. Press Contact Casey Craig , Global Head of Communications at CoinDesk [email protected] SOURCE CoinDesk Inc","image_url":"https://mma.prnewswire.com/media/1537755/CoinDeskLogo__1_Logo.jpg?p=original","source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"Evergreen Carbon Credits: Carbon Credits and Cryptocurrencies with NFT's","link":"https://www.prnewswire.com:443/news-releases/evergreen-carbon-credits-carbon-credits-and-cryptocurrencies-with-nfts-301502860.html","keywords":["Blockchain","Computer & Electronics","Cryptocurrency","BLN","CPR","ICO"],"creator":null,"video_url":null,"description":"PHOENIX, March 15, 2022 /PRNewswire/ - The criticism of cryptocurrencies' energy consumption and its related carbon footprint is a major challenge for all players in the crypto space and is being addressed at both a corporate and regulatory level by mandates such as the European Union's...","content":null,"pubDate":"2022-03-15 12:20:00","full_description":"PHOENIX , March 15, 2022 /PRNewswire/ - The criticism of cryptocurrencies' energy consumption and its related carbon footprint is a major challenge for all players in the crypto space and is being addressed at both a corporate and regulatory level by mandates such as the European Union's Sustainable Finance Disclosure Regulation (SFDR), which came into force in January 2022 . Bitcoin and other digital currencies are generated and verified by decentralized global networks of computers solving math problems of increasing complexity. Crypto mining requires massive amounts of computing energy, producing staggering environmental impacts. All told, Bitcoin emits over 57 million tons of CO2 annually according to Forex Suggest, a South Africa -based site that provides education on trading and financial markets. The environmental costs of using cryptocurrency could be drastically reduced by combining crypto mining with carbon offsets. In line with these developments, Evergreen Carbon Credits (ECC) has developed a unique purchasing and verification system of certified carbon credits utilizing blockchain technology and Non-Fungible Tokens (NFTs). The individual or business can select the amount of carbon credits they intend to purchase using the online calculator and an NFT certificate of the purchased amount of carbon credits is delivered to their digital wallet. Another key component of the ECC system is they accept cryptocurrency for payment. \"We have integrated a seamless, digital transaction as a means to reduce additional energy consumption,\" said Mark Davis , ECC's CTO, \"crypto miners and investors have the ability to offset their carbon footprint without converting their newly mined currencies into fiat, (US Dollars).\" In addition to crypto miners offsetting their carbon footprint, ECC's NFT carbon credits are a valuable resource for traders and cryptocurrency exchanges to become carbon neutral. According to Statista, one Ethereum transaction consumes the same amount of energy as 200,000 Visa transactions. With the ease of use and cryptocurrency friendly NFT carbon credits, the growth in crypto transaction energy consumption can be mitigated. ECC offers a proactive approach to becoming carbon neutral utilizing blockchain technology. With government agencies adding more regulations to crypto mining, monitoring, reporting and verification, (MRV) is an essential part of many of these sustainable markets. Integrating public blockchain and NFTs into a mining operation creates transparency. Because the transaction is recorded on the blockchain and an NFT is generated, no carbon credits can be duplicated and resold on the open market after they are retired. All high-quality certified carbon credits listed for sale are issued by a reputable organization and are third-party authenticated. Visit www.evergreencarboncredits.com for more information. Evergreen Carbon Credits is a subsidiary of Central Business Development. Central Business Development is a U.S. based innovative crypto-asset and blockchain development company that offers a variety of industry leading services. Evergreen Carbon Credits Contact: Shawn Young Director of Public Relations Email: [email protected] SOURCE Evergreen Carbon Credits","image_url":null,"source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"Global Crypto Asset Manager Hashdex to Launch Web3 ETF","link":"https://www.prnewswire.com:443/news-releases/global-crypto-asset-manager-hashdex-to-launch-web3-etf-301502346.html","keywords":["Banking & Financial Services","Cryptocurrency","ICO","FIN"],"creator":null,"video_url":null,"description":"ETF to provide investors with exposure to smart contracts platforms serving as the infrastructure for Web3 ETF to launch on B3 under WEB311 starting March 30th NEW YORK and SÃO PAULO, March 15, 2022 /PRNewswire/ -- Hashdex, a leading global crypto-focused asset manager, today announced...","content":null,"pubDate":"2022-03-15 11:05:00","full_description":"ETF to provide investors with exposure to smart contracts platforms serving as the infrastructure for Web3 ETF to launch on B3 under WEB311 starting March 30th NEW YORK and SÃO PAULO, March 15, 2022 /PRNewswire/ -- Hashdex , a leading global crypto-focused asset manager, today announced the upcoming launch of its Web3 ETF. The firm's newest crypto ETF will be available on the Brazilian stock exchange, B3, under the ticker symbol WEB311 starting March 30, 2022 . Hashdex's latest product was developed with the objective of offering a secure and diversified method for investing in Web3 and its underlying smart contract platforms. The reserve period for the new ETF begins Monday, March 14, 2022 through Friday, March 25, 2022 . \"We believe Web3 represents the future of the internet and is a further indication of the possibilities offered through blockchain technology,\" said Marcelo Sampaio , co-founder and CEO at Hashdex. \"The WEB311 ETF not only provides exposure to the smart contract platforms underpinning Web3, but serves as an accessible and unique way to invest in projects that will be the main engine of the internet of the future.\" Developed in partnership with CF Benchmarks, one of the leading global providers of digital asset market indices, WEB311 will replicate the \"CF Web 3.0 Smart Contract Platforms Index\". The Index allocates to digital assets native to smart contract blockchains, with an initial composition of seven large digital assets: Ethereum (22.5%); Cardano (22.5%); Solana (22.1%); Polkadot (19.5%); Algorand (8.8%); Tezos (3.5%); and Cosmos (1.1%). \"CF Benchmarks is immensely proud its Web 3.0 Smart Contract Platforms Index will be replicated by the world's first ETF dedicated to Smart Contract Blockchain Assets - the ground-breaking WEB311 ETF. Hot on the heels of the DEFI11 ETF, this launch is further proof of growing investor demand for regulated exposure to specific segments of the fast-maturing blockchain economy, demonstrating how our partners at Hashdex are committed to delivering innovation for both institutional and individual investors,\" said Sui Chung , CEO of CF Benchmarks. Marks Hashdex's Continued Advancement of Crypto ETF Offerings The WEB311 ETF further builds on Hashdex's innovative and unique crypto offerings available to trade on the B3. The firm launched the world's first crypto ETFs, including HASH11, which currently has more than 150,000 investors, BITH11, a 100% green Bitcoin product, ETHE11, an index fund that invests entirely in Ethereum, and DEFI11, which seeks to offer investors diversified, secure, and regulated exposure in all segments of the DeFi ecosystem. About Hashdex Hashdex is a global pioneer in crypto asset management. Hashdex's simple and secure funds invite innovative investors to join the emerging crypto economy. Hashdex's mission is to provide educational resources and best-in-class products that advance its efforts to build pathways to prosperity by opening the crypto ecosystem to the world. The firm co-created and launched the Nasdaq Crypto Index™ (NCI™) to provide global investors with a reliable benchmark for the crypto asset class. In 2021, Hashdex introduced the world's first crypto index ETFs, enabling over 250,000 investors to simply and securely add crypto to their portfolios. For more information visit www.hashdex.com . About CF Benchmarks CF Benchmarks is the leading provider of cryptocurrency benchmark indices, authorized and regulated by the UK FCA under the UK BMR. Its benchmark indices are provided through public methodologies and transparent governance; for tracking, valuing and settling risk in cryptocurrency financial services and products. CF Benchmarks' indices have been used to settle over $400bn of cryptocurrency derivative contracts listed for trading by CME Group and Kraken Futures, as well as serving as the reference index for ETFs and ETPs listed in Canada , Germany , Switzerland , France , and Brazil . CF Benchmarks is a wholly-owned subsidiary of Kraken. Media Contacts for Hashdex: Kendal Till / Josh Gerth Dukas Linden Public Relations [email protected] Jack S. Song Hashdex [email protected] Media Contact for CF Benchmarks: Caroline Baker US Communications at Kraken [email protected] SOURCE Hashdex","image_url":"https://mma.prnewswire.com/media/1709063/Combomark_Color_Logo.jpg?p=original","source_id":"cision","country":["singapore"],"category":["top"],"language":"english"},{"title":"Engiven Launches Cryptocurrency Ukraine Emergency Relief Fund","link":"https://www.prnewswire.com:443/news-releases/engiven-launches-cryptocurrency-ukraine-emergency-relief-fund-301502331.html","keywords":["Computer & Electronics","CPR"],"creator":null,"video_url":null,"description":"SAN DIEGO, March 15, 2022 /PRNewswire/ -- Engiven, a leading cryptocurrency donation services company, announced the launch of its Ukraine Emergency Relief Fund through the Engiven Charitable Foundation (ECF). The Ukraine Emergency Relief Fund provides the ability for crypto donors to...","content":null,"pubDate":"2022-03-15 09:00:00","full_description":"SAN DIEGO , March 15, 2022 /PRNewswire/ -- Engiven, a leading cryptocurrency donation services company, announced the launch of its Ukraine Emergency Relief Fund through the Engiven Charitable Foundation (ECF). The Ukraine Emergency Relief Fund provides the ability for crypto donors to support Ukraine relief efforts to nonprofit organizations who are currently engaged in humanitarian relief work in Ukraine . The ECF was established to provide a safe and effective way for donors to make crypto donations to registered nonprofits in the United States and NGOs abroad. The Ukraine Emergency Relief Fund is the ECF's first fund and focuses solely on providing lifesaving humanitarian assistance to those suffering in Ukraine . The Ukraine Emergency Relief Fund currently supports United Help Ukraine, The Salvation Army, Samaritan's Purse, Unicef, Doctors Without Borders, Convoy of Hope, UNHCR, and World Vision. Additional nonprofit organizations may be added to the fund. James Lawrence , CEO of Engiven shares, \"Our thoughts and prayers go out to the people of Ukraine in this difficult and tragic time. Engiven and its team are compelled to help support the nonprofit organizations that are directly impacting the lives of the Ukrainian people.\" Crypto donations made to the fund and the nonprofits supported by the fund are immediately exchanged for fiat and given directly to the nonprofits. Donations made to the fund are divided equally. Crypto donations to support Ukraine can be made at https://platform.engiven.com/ukraine . About Engiven Founded in 2018, Engiven is a leading provider of cryptocurrency donation services to nonprofits and faith-based organizations. The Engiven platform provides a highly automated crypto giving solution that includes block chain monitoring, automatic exchanges, gift receipts, bank deposits, IRS tax form creation, custody options, and a full suite of developer APIs. For more information about Engiven, visit https://engiven.com SOURCE Engiven, Inc.","image_url":"https://mma.prnewswire.com/media/1386905/Engiven_Logo.jpg?p=original","source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"EQONEX and Capitalise.ai join forces to provide crypto traders with automated AI trading strategies, execution and research","link":"https://www.prnewswire.com:443/news-releases/eqonex-and-capitaliseai-join-forces-to-provide-crypto-traders-with-automated-ai-trading-strategies-execution-and-research-301502583.html","keywords":["Blockchain","Computer & Electronics","Artificial Intelligence","Cryptocurrency","ICO","BLN","CPR","AFI"],"creator":null,"video_url":null,"description":"Crypto exchange EQONEX onboards Capitalise.ai auto-trading natural language platform to provide crypto trading clients with enhanced trading tools to analyse and automate execution SINGAPORE, March 15, 2022 /PRNewswire/ -- Digital asset financial services company EQONEX Limited (NASDAQ:...","content":null,"pubDate":"2022-03-15 06:11:00","full_description":"Crypto exchange EQONEX onboards Capitalise.ai auto-trading natural language platform to provide crypto trading clients with enhanced trading tools to analyse and automate execution SINGAPORE , March 15, 2022 /PRNewswire/ -- Digital asset financial services company EQONEX Limited (NASDAQ: EQOS ) and Capitalise.ai , a global technology leader of a groundbreaking trading automation and analysis platform, have partnered to provide EQONEX clients with a range of simple-to-use, advanced trading features to elevate their trading performance including automated trading strategies, research, analysis, and real-time alerts. The Capitalise.ai platform will provide EQONEX traders with the ability to analyze and deploy a range of strategies that were previously only utilized by sophisticated, technical traders. The platform removes barriers for traders that may not have technical or coding skills, by enabling them to create and test trading scenarios using everyday English text commands. It also delivers alerts and insights on-the-go, provided by Capitalise.ai's engine. Capitalise.ai's proprietary technology is based on artificial intelligence, machine learning and natural language processing to turn English-based text rules entered by traders into custom algorithmic trading strategies that can automatically provoke alerts and be instantly executed. EQONEX clients will receive free access to Capitalise.ai's full suite of analytics and automated trading tools, including back-testing, trading bots, smart notifications and much more. Users will also be able to access Capitalise.ai's mobile app for Android and iOS, so that they can stay in control of their trades 24/7, 365 days a year, and free themselves from sitting in front of the desktop. \"EQONEX is focused on meeting the discerning needs of experienced traders who are looking to unlock the potential of crypto markets through safe, reliable trade execution on a trusted exchange. We are excited to expand the benefits of our platform by offering the game-changing technologies offered by Capitalize.ai to empower our traders to upskill and optimize their trading strategies and performance,\" said Andrew Eldon , Interim CEO of EQONEX. Amir Shiovich, Capitalise.ai CEO & Co-Founder: \"2022 has started beautifully for Capitalise, and as the online trading industry is booming, I expect things to look even better soon. I am delighted to welcome EQONEX on-board, and I am sure that they will find Capitalise valuable as much as our other partners do. We look forward to making a real impact on their traders' habits and day to day lifestyle.\" Free access to Capitalize.ai is available to EQONEX customers by creating an account at Eqonex.capitalise.ai. About EQONEX EQONEX is a NASDAQ-listed digital assets financial services company focused on fairness, governance and innovation. The group encompasses cryptocurrency exchange EQONEX as well as an over-the-counter trading platform. It also offers a front-to-back integrated trading platform, Access Trading, a securitization advisory service, EQONEX Capital, market leading hot and cold custodian Digivault and asset manager Bletchley Park. About Capitalise.ai Capitalise.ai is a world leader creator of an analytics and trading automation platform that amplifies top-tier brokerage firms' performance by offering a game changing trading experience for traders worldwide. In the last year, Capitalise.ai more than tripled its partnerships, number of active traders, usage scale and trading activity. With Capitalise.ai, brokers can offer their traders analytical instruments and seamless automated trading experience previously reserved only for highly technical traders with the know-how to build scripts on their own or use technical solutions. For the first time, traders with zero technical skills can automate their trading, using freestyle text, such as \"if/then\" plain English rules. Capitalise.ai's platform is extensive and rich in capabilities and features and is being utilized by leading brokers worldwide. Among its partners are leading brokerage firms such as Interactive brokers, FXCM, Binance, FTX, Eightcap, Erisx and more. https://www.capitalise.ai/ . SOURCE EQONEX","image_url":null,"source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"BINANCE AWARDED CRYPTO-ASSET SERVICE PROVIDER LICENSE IN THE KINGDOM OF BAHRAIN","link":"https://www.prnewswire.com:443/news-releases/binance-awarded-crypto-asset-service-provider-license-in-the-kingdom-of-bahrain-301502288.html","keywords":["Blockchain","Computer & Electronics","Financial Technology","Banking & Financial Services","Cryptocurrency","FIN","BLN","CPR","ICO","FNT"],"creator":null,"video_url":null,"description":"MANAMA, Bahrain, March 14, 2022 /PRNewswire/ -- Binance, the world's leading blockchain and cryptocurrency infrastructure provider, today announces that it has been granted a crypto-asset service provider license from the Central Bank of Bahrain (CBB). This landmark achievement for...","content":null,"pubDate":"2022-03-14 21:57:00","full_description":"MANAMA, Bahrain , March 14, 2022 /PRNewswire/ -- Binance, the world's leading blockchain and cryptocurrency infrastructure provider, today announces that it has been granted a crypto-asset service provider license from the Central Bank of Bahrain (CBB). This landmark achievement for Binance represents its first license as a crypto-asset provider in The Cooperation Council for the Arab States of the Gulf (GCC) and demonstrates its commitment to being in regulatory compliance as the first of its group of companies in the region. Changpeng Zhao (CZ), founder and CEO of Binance, said: \"The license from Bahrain is a milestone in our journey to being fully licensed and regulated around the world. I would like to thank Team Bahrain, guided by the visionary leadership of HRH Prince Salman bin Hamad Al Khalifa , Crown Prince and Prime Minister, for the great work in facilitating this achievement. Team Bahrain has shown considerable foresight in its development of crypto regulations and provides the regulatory protections that consumers should come to expect from regulators around the world. \"I'm proud of the hard work of the Binance team to meet the stringent criteria of the Central Bank of Bahrain , not just locally but globally by ensuring that we meet and exceed the requirements of regulators and protect users with strong anti-money laundering and counter-terrorism financing policies.\" The crypto-asset license will allow Binance to provide crypto-asset trading, custodial services and portfolio management to customers under the supervision of the Bahrain regulators. HE Rasheed Al Maraj , Governor of the Central Bank of Bahrain commented: \"Developing regulations aligned with global trends is a key objective for us at the CBB. We continue to work with partners and industry leaders such as Binance to develop regulations that enable innovation and best practices.\" Khalid Humaidan, CEO of the Bahrain Economic Development Board (EDB) added: \"Team Bahrain has built a world-class infrastructure to support the fast-growing blockchain and crypto industry, with robust regulations and diverse talent within the financial services, fintech and technology sectors. Collaboration with industry leaders such as Binance will further enhance our mission to establish the Kingdom of Bahrain as a leading business hub.\" About Binance Binance is the world's leading blockchain ecosystem and cryptocurrency infrastructure provider with a financial product suite that includes the largest digital asset exchange by volume. Trusted by millions worldwide, the Binance platform is dedicated to increasing the freedom of money for users, and features an unmatched portfolio of crypto products and offerings, including: trading and finance, education, data and research, social good, investment and incubation, decentralization and infrastructure solutions, and more. For more information, visit: https://www.binance.com . About the Central Bank of Bahrain The Central Bank of Bahrain (CBB) is a public corporate entity established by the 2006 CBB and Financial Institutions Law. It was created on 6th September 2006 . The CBB is responsible for maintaining monetary and financial stability in the Kingdom of Bahrain . It succeeded the Bahrain Monetary Agency, which had previously carried out central banking and regulatory functions since its establishment in 1973. The CBB inherits the BMA's 33-year track record and wide range of responsibilities. It implements the Kingdom's monetary policy, public debt issuance, issues the national currency and oversees the country's payments and settlement systems. It is also the sole regulator of Bahrain's financial sector, covering the full range of banking, insurance, investment business and capital markets activities. The CBB's wide scope of responsibilities allows a consistent policy approach to be undertaken across the whole of the Kingdom's financial sector. It also provides a straightforward and efficient regulatory framework for financial services firms operating in Bahrain . About the Bahrain Economic Development Board The Bahrain Economic Development Board (EDB) is an investment promotion agency with overall responsibility for attracting investment into the Kingdom and supporting initiatives that enhance the investment climate. The EDB works with the government and both current and prospective investors, in order to ensure that Bahrain's investment climate is attractive, to communicate the key strengths, and to identify where opportunities exist for further economic growth through investment. The EDB focuses on several economic sectors that capitalise on Bahrain's competitive advantages and provide significant investment opportunities. These sectors include financial services, manufacturing, ICT, tourism, logistics and transport. The financial services sector is particularly strong in Bahrain and the EDB works to support the continued growth of the banking industry and key sub-sectors, including Islamic finance. For more information on the Bahrain EDB visit www.bahrainedb.com ; for information about Bahrain visit www.bahrain.com . Logo - https://mma.prnewswire.com/media/1755007/Binance_Logo.jpg SOURCE Binance","image_url":"https://mma.prnewswire.com/media/1755007/Binance_Logo.jpg?p=publish","source_id":"cision","country":["singapore"],"category":["business"],"language":"english"},{"title":"Ukraine's Ministry of Digital Transformation, FTX, and Everstake Launch Crypto Fundraising Site Aid For Ukraine","link":"https://www.prnewswire.com:443/news-releases/ukraines-ministry-of-digital-transformation-ftx-and-everstake-launch-crypto-fundraising-site-aid-for-ukraine-301501959.html","keywords":["Blockchain","Computer & Electronics","Financial Technology","Banking & Financial Services","Cryptocurrency","CPR","BLN","ICO","FNT","FIN"],"creator":null,"video_url":null,"description":"KYIV, Ukraine, March 14, 2022 /PRNewswire/ -- The official website for Aid For Ukraine, an initiative that raises funds from the crypto community for the benefit of Ukraine's military and humanitarian needs, has officially launched. The initiative is powered by the Ministry of Digital...","content":null,"pubDate":"2022-03-14 15:41:00","full_description":"KYIV, Ukraine , March 14, 2022 /PRNewswire/ -- The official website for Aid For Ukraine , an initiative that raises funds from the crypto community for the benefit of Ukraine's military and humanitarian needs, has officially launched. The initiative is powered by the Ministry of Digital Transformation of Ukraine , FTX , and Everstake . This is the first instance of a cryptocurrency exchange providing a conduit for crypto donations to a public financial institution. Aid for Ukraine logo (PRNewsfoto/Everstake) The launch of an official website enables users from around the world to have a simple way to make cryptocurrency donations to Ukraine . Anyone is now able to select the desirable amount in selected cryptocurrencies to donate, connect a wallet, and confirm a transaction within the same user-friendly interface. The fundraising process will be traceable in real-time on the website. The overall amount of donations will be summed up and tentatively expressed in USD at the Coingecko rate. The website also makes it possible to add more cryptocurrencies to the initiative thanks to the involvement of Everstake, the biggest decentralized staking provider in the industry. The company's officers are in direct contact with the community representatives willing to take part in helping the people of Ukraine . The crypto community does not want to stand aside and watch Ukrainians suffer from the unprovoked aggression by the Russian Federation and the subsequent humanitarian disaster unseen in Europe since the Balkan war. \"Freedom has always been at the bedrock of the crypto community. It is the same fundamental value that Ukraine is currently fighting for, and the crypto community expressed its strong desire to help Ukraine right after the onset of this abysmal war. As a part of this great community and as a Ukraine -based company we feel an obligation to help in whatever way we can. That is how and why Aid For Ukraine came to be,\" Sergey Vasilchuk , CEO at Everstake said. So far, users can donate to the existing wallets of the Ministry of Digital Transformation in BTC, ETH, USDT (TRC-20), DOT, SOL, DOGE, and XMR. The initiative has also added ICX, EOS, and NEO. Aid For Ukraine will add other cryptocurrencies over time. \"ICON Foundation is joining global community efforts by pledging $1M towards aid and relief for the Ukrainian people. I hope that our technology and community can make a small contribution in this time of need,\" Min Kim , founder of ICON states. Aid For Ukraine is cooperating with the cryptocurrency exchange FTX which converts crypto funds received into fiat and sends the donations to the National Bank of Ukraine . This marks the first-ever instance of a cryptocurrency exchange directly cooperating with a public financial entity to provide a conduit for crypto donations. Earlier this month, FTX already converted $1 million worth of SOL and transferred it to the National Bank of Ukraine . \"At the onset of the conflict in Ukraine , FTX felt the need to provide assistance in any way it could. By working with the Ministry of Digital Transformation to set up payment rails and facilitate the conversion of crypto donations into fiat currency, we have given the National Bank of Ukraine the ability to deliver aid and resources to the people who need it most. We are grateful for the opportunity to work with Sergey and the Everstake team as they continue to work tirelessly in helping Ukrainians as they suffer from this conflict,\" Sam Bankman-Fried , the founder and CEO of FTX commented. The crypto community has already donated more than $80 million to Ukraine , with over $50 million going to the official accounts of Ukraine's Ministry of Digital Transformation. Aid For Ukraine seeks to raise more donations for Ukraine in the crypto community. Every contribution is important and valuable. \"Today, crypto is playing a significant role in Ukraine's defense. Crypto assets proved extremely helpful in facilitation of funding flows to Ukrainian citizens and soldiers, as well as in raising awareness and engaging people worldwide. The amount of crypto crowdfunding for our country is already the biggest in history so far. We expect that the NFT collection will give the next boost to the crypto fundraising process. Huge thanks to the crypto community for this unprecedented support of Ukraine and its defense of the principles of democracy and freedom in face of the war waged by the Russian Federation ,\" Oleksandr Bornyakov, the Deputy Minister of Digital Transformation of Ukraine on IT industry development said. The funds will be used to help the Armed Forces of Ukraine as well as Ukrainian civilians in dire need of humanitarian aid. To learn more about Aid For Ukraine and support its efforts, please visit: https://donate.thedigital.gov.ua/ . About the initiators of Aid For Ukraine About the Ministry of Digital Transformation The Ministry of Digital Transformation is one of the governmental authorities in Ukraine . Main mission is to build the most convenient and user-friendly country in the world. The Ministry is focused on creating \"state in a smartphone\". This combines both Diia mobile application and Diia web portal, where citizens store e-docs and get access to public services. The Ministry's vision is that the state should not be associated with a scary monster, corruption and bureaucracy, but become a convenient friendly service. State must provide quality and efficient service to citizens and businesses. This global goal is expanded into 4 specific strategic goals of the Ministry until 2024: Transfer 100% of all public services for citizens and businesses online. Provide 95% of transport infrastructure, settlements and their social facilities with access to high-speed Internet. To teach 6 million Ukrainians digital skills. Increase the share of IT in the country's GDP to 10%. About FTX FTX.COM is a cryptocurrency exchange built by traders, for traders. It offers innovative products, including industry-leading derivatives, options and volatility products, tokenized stocks, prediction markets, leveraged tokens and an OTC desk. FTX.COM strives to be an intuitive yet powerful platform for all kinds of users, and to be the most innovative exchange in the industry. FTX.COM has grown quickly since its founding, becoming one of the most respected cryptocurrency exchanges in the world in less than 3 years. To learn more about FTX.COM , please visit: https://ftx.com/ FTX.COM is not available to US residents or residents of other prohibited jurisdictions, as set out in its Terms of Service. About Everstake Everstake is a Ukraine -based company and the biggest decentralized staking provider in the blockchain industry, trusted by 625,000 users. The company has used enterprise-level hardware to run nodes for the most popular blockchain networks since 2018. Everstake employs 100+ experts across the world and creates complex blockchain products, such as lending protocols, staking pools, blockchain bridges, and marketplaces. The company has been heavily involved in the development of projects like Metaplex, Wormhole, and Everlend. Media contacts Liliia Tulupenko, PR & Communications at the Ministry of Digital Transformation of Ukraine : [email protected] M Group Strategic Communications (for FTX): [email protected] Vlad Likhuta, Head of Growth at Everstake: [email protected] SOURCE Everstake","image_url":"https://mma.prnewswire.com/media/1765392/Aid_For_Ukraine.jpg?p=original","source_id":"cision","country":["singapore"],"category":["top"],"language":"english"}],"nextPage":1}
